{
  "projects": [
    {
      "repoName": "Eliot-Downloader",
      "name": "Eliot Downloader",
      "category": "Full-Stack App",
      "status": "Complete",
      "description": "Web-based media downloader supporting 1000+ platforms including YouTube, Instagram, TikTok, and Facebook with user accounts and an admin dashboard.",
      "details": "A full-stack Flask application with user registration/login, an admin dashboard with analytics, and real-time download progress via SocketIO. Supports video (MP4), audio (MP3), and photo downloads with quality selection. Includes cookie authentication for restricted content, batch processing, activity tracking, and a contact inbox system. Built as a practice project for full-stack Python development.",
      "tech": ["Python", "Flask", "SocketIO", "yt-dlp", "HTML/CSS", "JavaScript"],
      "github": "https://github.com/aimemoria/Eliot-Downloader",
      "liveUrl": null,
      "autoGenerated": false
    },
    {
      "repoName": "Eliot-Downloader-Streamlit",
      "name": "Eliot Downloader (Streamlit)",
      "category": "Full-Stack App",
      "status": "Practice",
      "description": "Streamlit version of Eliot Downloader, a simpler cloud-compatible media downloader with a dark-themed UI.",
      "details": "A lighter version of Eliot Downloader rebuilt with Streamlit for rapid prototyping. Supports multiple quality options (360p to 1080p), MP3 audio extraction, cookie management for private content, and real-time progress tracking. Uses temp directories for cloud compatibility. Built as practice for Python web app development and cloud deployment.",
      "tech": ["Python", "Streamlit", "yt-dlp", "FFmpeg"],
      "github": "https://github.com/aimemoria/Eliot-Downloader-Streamlit",
      "liveUrl": null,
      "autoGenerated": false
    },
    {
      "repoName": "moment-rental-platform",
      "name": "Moment Rental Platform",
      "category": "Full-Stack App",
      "status": "Complete",
      "description": "A property rental platform built with Next.js 16, featuring guest booking, host management, payments via Flutterwave, and an admin panel.",
      "details": "A full-featured rental marketplace where guests can search/book properties and hosts can list/manage them. Includes Flutterwave payment processing (cards, mobile money, bank transfers), host verification workflow (ID, selfie, proof of address), real-time messaging, reviews/ratings, earnings dashboard, and admin moderation tools. Uses PostgreSQL with Prisma ORM, NextAuth.js for auth, Cloudinary for images, and Tailwind CSS for styling.",
      "tech": ["Next.js", "TypeScript", "PostgreSQL", "Prisma", "Tailwind CSS", "Flutterwave", "NextAuth.js"],
      "github": "https://github.com/aimemoria/moment-rental-platform",
      "liveUrl": null,
      "autoGenerated": false
    },
    {
      "repoName": "spring-boot-oauth",
      "name": "Spring Boot OAuth",
      "category": "Practice",
      "status": "Practice",
      "description": "A Spring Boot practice project demonstrating traditional login and Google OAuth 2.0 sign-in with role-based authorization.",
      "details": "An orders management app built to practice Spring Security. Features username/password registration, Google OAuth 2.0 (OIDC) login, role-based access control (ROLE_USER, ROLE_ADMIN), and CRUD operations on orders. Uses Thymeleaf templates, MySQL database with JDBC, and Spring Security 6 configuration.",
      "tech": ["Java 17", "Spring Boot 3", "Spring Security", "OAuth 2.0", "MySQL", "Thymeleaf", "Maven"],
      "github": "https://github.com/aimemoria/spring-boot-oauth",
      "liveUrl": null,
      "autoGenerated": false
    },
    {
      "repoName": "QuickBank-Console",
      "name": "QuickBank Console",
      "category": "Practice",
      "status": "Practice",
      "description": "A console-based banking simulation in Java for practicing OOP fundamentals: account creation, deposits, withdrawals, and interest calculation.",
      "details": "A simple two-file Java console app built to practice object-oriented programming. Users create an account with a unique ID and initial balance ($500 minimum), then interact through a menu to deposit, withdraw, view daily interest rates, and check account details. Includes input validation and insufficient balance protection. Consists of BankApplication.java (UI/menu) and CheckingAccount.java (account model).",
      "tech": ["Java", "OOP"],
      "github": "https://github.com/aimemoria/QuickBank-Console",
      "liveUrl": null,
      "autoGenerated": false
    },
    {
      "repoName": "musicSite-Template",
      "name": "HIDDENTIMES Music",
      "category": "Practice",
      "status": "Practice",
      "description": "A React single-page landing page for a music project, built as front-end practice with a dark theme and smooth navigation.",
      "details": "A practice project for front-end development. Features a fixed navbar with backdrop blur, full-screen hero with radial gradient, interactive track listing with click-to-select, and about/contact sections. Responsive design with mobile support. Built with React 18 and custom CSS with Google Fonts (Inter).",
      "tech": ["React 18", "CSS3", "JavaScript"],
      "github": "https://github.com/aimemoria/musicSite-Template",
      "liveUrl": null,
      "autoGenerated": false
    },
    {
      "repoName": "DiamondHunt-VR",
      "name": "DiamondHunt VR",
      "category": "Practice",
      "status": "Practice",
      "description": "A Unity VR simulation set in a desert environment where the player searches for a diamond while facing narrative-driven ethical decisions.",
      "details": "A practice VR project built with Unity and C#. The player explores a desert environment in first-person VR to locate a lost diamond inside a hut. Features branching narrative with ethical decision points that change the outcome. The project explores how player choices shape experiences in interactive settings. Built as practice for game development and VR interaction design.",
      "tech": ["Unity", "C#", "VR"],
      "github": "https://github.com/aimemoria/DiamondHunt-VR",
      "liveUrl": null,
      "autoGenerated": false
    },
    {
      "repoName": "ElliotMedia",
      "name": "Elliot Media",
      "category": "Website",
      "status": "Complete",
      "description": "My personal company website. Elliot Media is a real estate photography and media service based in Phoenix, Arizona.",
      "details": "The official website for Elliot Media, my real estate photography and media service company. Offers professional photography, aerial drone shots, videography, 3D virtual tours, and floor plans. Features a property showcase carousel, portfolio filtering system (Photos, Drone, Video, 3D Tours), contact form via Web3Forms, smooth scrolling navigation, and full SEO optimization with Open Graph and schema.org structured data.",
      "tech": ["HTML", "CSS", "JavaScript", "Web3Forms", "SEO"],
      "github": "https://github.com/aimemoria/ElliotMedia",
      "liveUrl": "https://elliotmediapro.com/",
      "autoGenerated": false
    },
    {
      "repoName": "aimePersonalWebsite",
      "name": "Aime Moria (Personal Website)",
      "category": "Website",
      "status": "Complete",
      "description": "My personal portfolio website showcasing my skills, experience, and projects as a Computer Science student and Data Analyst.",
      "details": "A responsive personal portfolio site with sections for bio, skills, and contact. Features dark mode toggle, animated particle canvas background, dynamic year counter, social media integration, and a contact form powered by EmailJS. Hosted on Firebase with custom domain. Built with vanilla HTML, CSS, and JavaScript.",
      "tech": ["HTML", "CSS", "JavaScript", "Firebase", "EmailJS"],
      "github": "https://github.com/aimemoria/aimePersonalWebsite",
      "liveUrl": "https://aime-moria.com/",
      "autoGenerated": false
    },
    {
      "repoName": "Fraud-Detection",
      "name": "Fraud Detection System",
      "category": "Data Science",
      "status": "Complete",
      "description": "A client-server system that streams financial transaction data in real-time for training neural networks in fraud detection.",
      "details": "Implements a TCP/IP socket-based architecture where a server generates and broadcasts simulated banking transactions (with embedded fraud patterns) to multiple clients. Clients perform real-time analysis with live visualizations. Includes a visual GUI client with real-time charts (Matplotlib), feature engineering pipeline, and ANN training for fraud classification using PyTorch. Built for a Search Engines and Data Mining course.",
      "tech": ["Python", "PyTorch", "TCP Sockets", "Matplotlib", "Threading"],
      "github": "https://github.com/aimemoria/Fraud-Detection",
      "liveUrl": null,
      "autoGenerated": false
    },
    {
      "repoName": "nlp-sentiment-analysis",
      "name": "NLP Sentiment Analysis",
      "category": "Data Science",
      "status": "Practice",
      "description": "A natural language processing project for classifying text sentiment, built for an NLP course.",
      "details": "An NLP project that applies text preprocessing, tokenization, and feature extraction to classify sentiment in text data. Part of coursework for AIT-204 NLP. Includes a requirements.txt for dependencies and test data for review classification.",
      "tech": ["Python", "NLP", "Jupyter"],
      "github": "https://github.com/aimemoria/nlp-sentiment-analysis",
      "liveUrl": null,
      "autoGenerated": false
    }
  ],
  "lastUpdated": "2026-02-09T00:00:00.000Z"
}
